//----------------------------------------------------------------------------------------------------------------------
// - Знайти та вивести довижину настипних стрінгових значень
// 'hello world', 'lorem ipsum', 'javascript is cool'
// - Перевести до великого регістру наступні стрінгові значення
// 'hello world', 'lorem ipsum', 'javascript is cool'
// - Перевести до нижнього регістру настипні стрінгові значення
// 'HELLO WORLD', 'LOREM IPSUM', 'JAVASCRIPT IS COOL'
// - Є "брудна" стрінга let str = ' dirty string   ' . Почистити її від зайвих пробілів.
//
//
// - Напишіть функцію stringToarray(str), яка перетворює рядок на масив слів.
//     let str = 'Ревуть воли як ясла повні';
// let arr = stringToarray(str); ['Ревуть', 'воли', 'як', 'ясла', 'повні']
//----------------------------------------------------------------------------------------------------------------------
// - Знайти та вивести довижину настипних стрінгових значень
// 'hello world', 'lorem ipsum', 'javascript is cool'
//----------------------------------------------------------------------------------------------------------------------
// let main = ['hello world', 'lorem ipsum', 'javascript is cool'];
// for (let item of main) {
//     console.log(`${item} - ${item.length}`);
// }
//----------------------------------------------------------------------------------------------------------------------
// - Перевести до великого регістру наступні стрінгові значення
// 'hello world', 'lorem ipsum', 'javascript is cool'
//----------------------------------------------------------------------------------------------------------------------
// let main = ['hello world', 'lorem ipsum', 'javascript is cool'];
// for (let item of main) {
//     console.log(item.toUpperCase());
// }
//----------------------------------------------------------------------------------------------------------------------
// - Перевести до нижнього регістру настипні стрінгові значення
// 'HELLO WORLD', 'LOREM IPSUM', 'JAVASCRIPT IS COOL'
//----------------------------------------------------------------------------------------------------------------------
// let main = ['HELLO WORLD', 'LOREM IPSUM', 'JAVASCRIPT IS COOL'];
// for (let item of main) {
//     console.log(item.toLowerCase());
// }
//----------------------------------------------------------------------------------------------------------------------
// - Є "брудна" стрінга let str = ' dirty string   ' . Почистити її від зайвих пробілів.
//----------------------------------------------------------------------------------------------------------------------
// let str = ' dirty string   ';
// console.log(str.substring(1, 13));
//----------------------------------------------------------------------------------------------------------------------
// - Напишіть функцію stringToarray(str), яка перетворює рядок на масив слів.
//     let str = 'Ревуть воли як ясла повні';
// let arr = stringToarray(str); ['Ревуть', 'воли', 'як', 'ясла', 'повні']
//----------------------------------------------------------------------------------------------------------------------
// let str = 'Ревуть воли як ясла повні';
// let stringToArray = string => string.split(' ');
// console.log(stringToArray(str));
//----------------------------------------------------------------------------------------------------------------------