//----------------------------------------------------------------------------------------------------------------------
// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//----------------------------------------------------------------------------------------------------------------------
// let main = [1, 2, 3, 4, 5];
// for (let i of main) {
//     console.log(i);
// }
//----------------------------------------------------------------------------------------------------------------------
// let main = ['One', 'Two', 'Three', 'Four', 'Five'];
// for (let i of main) {
//     console.log(i);
// }
//----------------------------------------------------------------------------------------------------------------------
// let main = [1,2,3,4,5,'One','Two','Three','Four','Five',true,false,true,false,true];
// for (let i = 0; i < main.length; i++) {
//     console.log(main[i]);
// }
//----------------------------------------------------------------------------------------------------------------------
//--Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//----------------------------------------------------------------------------------------------------------------------
// let main = [];
// for (let i = 0;i < 5;i++){
//     main[i] = prompt('Input number');
//     if (main[4]){
//         console.log(main);
//     }
// }
//----------------------------------------------------------------------------------------------------------------------
// - є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//----------------------------------------------------------------------------------------------------------------------
// 1. перебрати його циклом while
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = 0;
// while (i < main.length) {
//     console.log(main[i]);
//     i++
// }
//----------------------------------------------------------------------------------------------------------------------
// 2. перебрати його циклом for
//----------------------------------------------------------------------------------------------------------------------
// for (let i = 0; i < main.length; i++) {
//     console.log(main[i]);
// }
//----------------------------------------------------------------------------------------------------------------------
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = 1;
// while (i < main.length) {
//     if (i % 2 !== 0) {
//         console.log(main[i]);
//     }
//     i++;
// }
//----------------------------------------------------------------------------------------------------------------------
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = 0; i < main.length; i++) {
//     if (i % 2 !== 0){
//         console.log(main[i]);
//     }
// }
//----------------------------------------------------------------------------------------------------------------------
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = 1;
// while (i < main.length) {
//     if (i % 2 === 0) {
//         console.log(main[i]);
//     }
//     i++;
// }
//----------------------------------------------------------------------------------------------------------------------
// 6. перебрати циклом for та вивести  числа тільки парні  значення
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = 1; i < main.length; i++) {
//     if (i % 2 === 0) {
//         console.log(main[i]);
//     }
// }
//----------------------------------------------------------------------------------------------------------------------
// 7. замінити кожне число кратне 3 на слово "okten"
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = 1; i < main.length; i++) {
//     if (i % 3 === 0) {
//         main[i] = 'okten';
//     }
// }
// for (let i of main) {
//     console.log(i);
// }
//----------------------------------------------------------------------------------------------------------------------
// 8. вивести масив в зворотньому порядку.
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = main.length - 1; i >= 0; i--){
//     console.log(main[i]);
// }
//----------------------------------------------------------------------------------------------------------------------
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//----------------------------------------------------------------------------------------------------------------------
// 7. замінити кожне число кратне 3 на слово "okten"
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = main.length - 1; i >= 1; i--) {
//     if (i % 3 === 0) {
//         console.log(main[i]);
//     }
// }
//----------------------------------------------------------------------------------------------------------------------
// 6. перебрати циклом for та вивести  числа тільки парні  значення
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = main.length - 1; i >= 1; i--) {
//     if (i % 2 === 0) {
//         console.log(main[i]);
//     }
// }
//----------------------------------------------------------------------------------------------------------------------
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = main.length -1;
// while (i >= 1) {
//     if (i % 2 === 0){
//         console.log(main[i]);
//     }
//     i--;
// }
//----------------------------------------------------------------------------------------------------------------------
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = main.length - 1; i >= 1; i--) {
//     if (i % 2 !== 0) {
//         console.log(main[i]);
//     }
// }
//----------------------------------------------------------------------------------------------------------------------
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = main.length - 1;
// while (i >= 1) {
//     if (i % 2 !== 0) {
//         console.log(main[i]);
//     }
//     i--;
// }
//----------------------------------------------------------------------------------------------------------------------
// 2. перебрати його циклом for
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = main.length - 1; i >= 0; i--) {
//     console.log(main[i]);
// }
//----------------------------------------------------------------------------------------------------------------------
// 1. перебрати його циклом while
//----------------------------------------------------------------------------------------------------------------------
// let main = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// let i = main.length - 1;
// while (i >= 0) {
//     console.log(main[i]);
//     i--;
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//----------------------------------------------------------------------------------------------------------------------
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
//----------------------------------------------------------------------------------------------------------------------
// let main = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (let i of main) {
//     console.log(i);
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
//----------------------------------------------------------------------------------------------------------------------
// let main = ['H', 'E', 'L', 'L', 'O', 'W', 'O', 'R', 'L', 'D'];
// let i = 0;
// while (i < main.length) {
//     console.log(main[i]);
//     i++;
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
//----------------------------------------------------------------------------------------------------------------------
// let main = [1,2,3,4,5,6,7,8,9,10];
// for (let i of main) {
//     console.log(i);
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
//----------------------------------------------------------------------------------------------------------------------
// let main = [1, 'One', a = false, 2, 'Two', b = true, 3, 'Three', c = false, 'String'];
// for (let i of main) {
//     if  (typeof i === 'boolean') {
//         console.log(i);
//     }
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
//----------------------------------------------------------------------------------------------------------------------
// let main = [1, 'One', a = false, 2, 'Two', b = true, 3, 'Three', c = false, 'String'];
// for (let i of main) {
//     if (typeof i === 'number') {
//         console.log(i);
//     }
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//----------------------------------------------------------------------------------------------------------------------
// let main = [1, 'One', a = false, 2, 'Two', b = true, 3, 'Three', c = false, 'String'];
// for (let i of main) {
//     if (typeof i === 'string') {
//         console.log(i);
//     }
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//----------------------------------------------------------------------------------------------------------------------
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
//----------------------------------------------------------------------------------------------------------------------
// let main = [];
// for (let i = 0; i <= 9; i++) {
//     main[i] = prompt('Input: ');
// }
// for (let i of main) {
//     console.log(i);
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//----------------------------------------------------------------------------------------------------------------------
// for (let i = 1; i <= 10; i = i + 1) {
//     console.log(`№ : ${i}`);
//     document.write(`|| № : ${i} ||   `);
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//----------------------------------------------------------------------------------------------------------------------
// for (let i = 1; i <= 100; i = i + 1) {
//     console.log(`№ - ${i}`);
//     document.write(`|№ - ${i}`);
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
//----------------------------------------------------------------------------------------------------------------------
// for (let i = 1; i <= 100; i += 2) {
//     console.log(`№ - ${i}`);
//     document.write(`|№ - ${i}`);
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
//----------------------------------------------------------------------------------------------------------------------
// for (let i = 2; i <= 100; i += 2) {
//     console.log(`№ - ${i}`);
//     document.write(`|№ - ${i}`);
// }
//----------------------------------------------------------------------------------------------------------------------
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//----------------------------------------------------------------------------------------------------------------------
// for (let i = 1; i < 100; i += 2) {
//     console.log(`№ - ${i}`);
//     document.write(`|№ - ${i}`);
// }
//----------------------------------------------------------------------------------------------------------------------