//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// - створити функцію яка обчислює та повертає площу кола з радіусом r
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
//----------------------------------------------------------------------------------------------------------------------
// function calc(input_a, input_b) {
//     let s =  input_a * input_b;
//     return s;
// }
// let input_a = prompt("Input : ");
// let input_b = prompt("Input : ");
// let num = calc(input_a, input_b);
// console.log(num);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу кола з радіусом r(2p*2)
//----------------------------------------------------------------------------------------------------------------------
// let num = radius(2);
// function radius (r) {
//     let sum = 3.14 * r * 2;
//     return sum;
// }
// console.log(num);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
//----------------------------------------------------------------------------------------------------------------------
// let num = area(2,2);
// function area(r, h) {
//     let sum = 2 * 3.14 * r * (h + r);
//     return sum;
// }
// console.log(num);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив та виводить кожен його елемент
//----------------------------------------------------------------------------------------------------------------------
// function main() {
// }
// let array = [2,4,13,54,7,44,98];
//----------------------------------------------------------------------------------------------------------------------