//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// - створити функцію яка обчислює та повертає площу кола з радіусом r
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
//----------------------------------------------------------------------------------------------------------------------
// function calc(input_a, input_b) {
//     let s =  input_a * input_b;
//     return s;
// }
// let input_a = prompt("Input : ");
// let input_b = prompt("Input : ");
// let num = calc(input_a, input_b);
// console.log(num);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу кола з радіусом r(2p*2)
//----------------------------------------------------------------------------------------------------------------------
// let num = radius(2);
// function radius (r) {
//     let sum = 3.14 * r * 2;
//     return sum;
// }
// console.log(num);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
//----------------------------------------------------------------------------------------------------------------------
// let num = area(2,2);
// function area(r, h) {
//     let sum = 2 * 3.14 * r * (h + r);
//     return sum;
// }
// console.log(num);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив та виводить кожен його елемент
//----------------------------------------------------------------------------------------------------------------------
// let array = [2, 4, 13, 54, 7, 44, 98];
// function main(massive) {
//     for (let field of massive) {
//         console.log(field);
//     }
// }
// main(array);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
//----------------------------------------------------------------------------------------------------------------------
// function textCreator(text) {
//     document.write(`<h1>${text}</h1>`);
// }
// let inputText = prompt('Input text : ');
// textCreator(inputText);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
//----------------------------------------------------------------------------------------------------------------------
// function listCreator(text) {
// document.write(`<ul>`);
//     for (let textArea = 0; textArea < 3; textArea++) {
//         document.write(`
//             <li>${text}</li>
//         `)
//     }
// document.write(`</ul>`);
// }
// let userText = prompt('Input text : ');
// listCreator(userText);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
//----------------------------------------------------------------------------------------------------------------------
// document.write(`<ul>`);
// function listCreator(text,listLength) {
//     for (let listItem = 0; listItem < listLength; listItem++) {
//         document.write(`<li>${text}</li>`)
//     }
// }
// document.write(`</ul>`);
// let listLength = prompt('Input list length :');
// let listText = prompt('Input list text :');
// listCreator(listText, listLength);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//----------------------------------------------------------------------------------------------------------------------
// let main = [];
// for (let ellArr = 0;ellArr<10;ellArr++){
//     main[ellArr] = prompt('Input massive element :');
// }
// document.write(`<ul>`);
// function arrList(array) {
//     for (let item = 0; item < array.length; item++) {
//         document.write(`<li>${array[item]}</li>`);
//     }
// }
// document.write(`</ul>`);
// arrList(main);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
//----------------------------------------------------------------------------------------------------------------------
let users = [
    {
        id: 0,
        name: 'Naomi',
        age: 19
    },
    {
        id: 1,
        name: 'Tanaka',
        age: 38
    },
    {
        id: 2,
        name: 'Yukiko',
        age: 49,
    },
    {
        id: 3,
        name: 'Sayaka',
        age: 23
    }
]
function userInfo(array) {
    for (let userArr of array) {
        for (let field in userArr) {
            document.write(`<div class = "item">${field} : ${userArr[field]}</div>`);
        }
    }
}
userInfo(users);
//----------------------------------------------------------------------------------------------------------------------